import React from "react";
import Card from './Card.jsx'
import bagIcon from "../assets/bagIcon.svg"
import drugIcon from "../assets/drugIcon.svg"
import dockIcon from "../assets/dockIcon.svg"
import foodIcon from "../assets/foodIcon.svg"
import lampIcon from "../assets/lampIcon.svg"
import medIcon from "../assets/medIcon.svg"
import bp1 from "../assets/1stSectionBP.png"
import bg2 from '../assets/2ndSectionBP.png'
import '../styles/main.scss'

const Main = () => {

    return (
        <div className="wrapper">
            <section>
                <div>
                    <h2>ТРИВОЖНА ВАЛІЗА</h2>
                    <span> - це підготований набір речей, необхідних у екстреній ситуації.</span>
                </div>
                <div>
                    <div>
                        <span>Найкращий вибір - вологостійкий міцний рюкзак обʼємом від 20 до 50 літрів</span>
                        <p>
                            Ваш зовнішній вигляд в умовах бойових дій має ідентифікувати вас, як цивільну людину. Ніяких
                            камуфляжних рюкзаків.
                        </p>
                    </div>
                    <div>
                        <img src={bp1} alt="backpacks"/>
                    </div>
                </div>

            </section>
            <section>
                <div>
                    <h2>ЩО ТРЕБА КЛАСТИ ?</h2>

                </div>
                <div>
                    <div className="cards">
                        <Card icon={dockIcon} title="Документи"
                              text="паспорт, водійське посвідчення, військовий квиток, документи на право власності"/>
                        <Card
                            icon={medIcon}
                            title="Медична картка"
                            text="група крові, перелік ліків, які ви приймаєте, перелік проблем зі здоровʼям, імена та телефони ваших лікарів"
                        />
                        <Card
                            icon={drugIcon}
                            title="Ліки"
                            text="бактерицидний пластир, крем від ураження шкіри, активоване вугілля, засіб від нежитю, засіб від нежитю, перекис водню, етиловий спирт, таблетки для очищення води"
                        />
                        <Card
                            icon={bagIcon}
                            title="Засоби для надання першої допомоги"
                            text="турнікети чи джгути Есмарха, лейкопластир, перевʼязувальний пакет ППІ, бинт, йод, вата"
                        />
                        <Card
                            icon={foodIcon}
                            title="Продуктовий набір"
                            text="півтора літри води на людину, тушонка, галети, швидкорозчинні супи, мʼясні чи рибні консерви, сухпайки, льодяники, низькокалорійні солодощі"
                        />
                        <Card
                            icon={lampIcon}
                            title="Речі для виживання"
                            text="одяг, ліхтарик, запальничка, свічки, швейцарський ніж, мультитул, сірники, сухі та вологі серветки, голка з ниткою, прозорий скотч, паракорд, каремат і спальний мішок, пакети для сміття"
                        />
                    </div>
                    <div>
                        <div>
                            <img src={bg2} alt="medpack"/>
                        </div>
                        <div>
                            <p>
                                На сайті Державної служби з надзвичайних
                                ситуацій містяться назви конкретних препаратів:
                                парацетамол, пенталгін, супрастин, імодіум, фталазол, альбуцид.
                            </p>
                        </div>
                    </div>
                    <div>
                        <p>
                            Залежно від того на скількох людей Ви збираєте тривожну валізу вона буває трьох типів:
                        </p>
                        <div>
                            <span>На одного</span>
                            <div>
                                <ul>
                                    <li>Документи</li>
                                    <li>Медична картка</li>
                                    <li>Ліки</li>
                                </ul>
                                <ul>
                                    <li>Засоби для надання першої допомоги</li>
                                    <li>Продуктовий набір (1,5 літра води)</li>
                                    <li>Речі для виживання та одяг</li>
                                </ul>
                            </div>
                            <span>На двох</span>
                            <div>
                                <ul>
                                    <li>Пакет документів</li>
                                    <li>Дві медичні картки</li>
                                    <li>Два набори ліків</li>
                                </ul>
                                <ul>
                                    <li>Засоби для надання першої допомоги</li>
                                    <li>Продуктовий набір (3 літри води)</li>
                                    <li>Речі для виживання та одяг</li>
                                </ul>
                            </div>
                            <span>На сім’ю</span>
                            <div>
                                <ul>
                                    <li>
                                        Пакет документів
                                        (свідоцтво про народження
                                        дитини)
                                    </li>
                                    <li>
                                        Медична картка всіх
                                        членів сім’ї
                                    </li>
                                    <li>
                                        Набір ліків для
                                        дорослих і дітей
                                    </li>
                                </ul>
                                <ul>
                                    <li>
                                        Засоби для надання першої допомоги
                                    </li>
                                    <li>
                                        Продуктовий набір (4 літри води)
                                    </li>
                                    <li>
                                        Речі для виживання та одяг
                                    </li>
                                    <li>
                                        Записка чи бейдж на дитину
                                    </li>
                                </ul>
                            </div>
                        </div>
                        <div>
                            <div>
                                <span>01</span>
                                <p>Найважче складайте на дно рюкзака</p>
                            </div>
                            <div>
                                <span>02</span>
                                <p>Речі з гострими кутами не повинні торкатись спини</p>
                            </div>
                            <div>
                                <span>03</span>
                                <p>Ті речі, що можна розчавити — нагору</p>
                            </div>
                            <div>
                                <span>04</span>
                                <p>На рюкзак слід одягнути дощовик або сміттєвий пакет</p>
                            </div>
                        </div>
                    </div>
                </div>
            </section>
        </div>
    )
}

export default Main